//*--------------------------------------------------------------------
//*- RUNS UNIT TEST CASES
//*--------------------------------------------------------------------
//P390RUNT   JOB  (ACCT#),'FADY',
//           MSGCLASS=X,NOTIFY=&SYSUID,PRTY=14,REGION=0M
//*--------------------------------------------------------------------
//RUNTEST  PROC
//RUN  EXEC PGM=&PGMNAME,REGION=1024K
//STEPLIB  DD DSN=P390.DEV.LOAD,DISP=SHR
//SYSPRINT DD SYSOUT=*
//            PEND
//*--------------------------------------------------------------------
//            EXEC RUNTEST,PGMNAME=PBCTDBLE
//*--------------------------------------------------------------------
//            EXEC RUNTEST,PGMNAME=PBCTFLOA
//*--------------------------------------------------------------------
//            EXEC RUNTEST,PGMNAME=PBCTSF32
//*--------------------------------------------------------------------
//            EXEC RUNTEST,PGMNAME=PBCTSF64
//*--------------------------------------------------------------------
//            EXEC RUNTEST,PGMNAME=PBCTSV32
//*--------------------------------------------------------------------
//            EXEC RUNTEST,PGMNAME=PBCTSV64
//*--------------------------------------------------------------------
//            EXEC RUNTEST,PGMNAME=PBCTSZ32
//*--------------------------------------------------------------------
//            EXEC RUNTEST,PGMNAME=PBCTSZ64
//*--------------------------------------------------------------------
//            EXEC RUNTEST,PGMNAME=PBCTUF32
//*--------------------------------------------------------------------
//            EXEC RUNTEST,PGMNAME=PBCTUF64
//*--------------------------------------------------------------------
//            EXEC RUNTEST,PGMNAME=PBCTUV32
//*--------------------------------------------------------------------
//            EXEC RUNTEST,PGMNAME=PBCTUV64
//*--------------------------------------------------------------------


