       IDENTIFICATION DIVISION.
       PROGRAM-ID. PBCTCUST.
      *****************************************************************
      * OVERVIEW                                                      *
      * --------                                                      *
      * TEST GENERATED PROGRAMS FOR: hierarchy.proto                  *
      *****************************************************************

       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       DATA DIVISION.
      *****************************************************************
      *        W O R K I N G    S T O R A G E    S E C T I O N        *
      *****************************************************************
       WORKING-STORAGE SECTION.
       01  PROTOBUF-BYTES                    PIC X(4096).
       01  PROTOBUF-BYTES-LEN                PIC 9(8) COMP-5.
       01  W-BYTES-USED                      PIC 9(8) COMP-5.
       01  PROTOBUF-BYTES-HEX-STRING         PIC X(8192).

       01  W-L                               PIC 9(4) COMP-5.

      *    // The COBOL structure
       01  CustomerData.
           03  Child1.
             05  child2 PIC X(32) DISPLAY.
           03  child3 PIC X(32) DISPLAY.

       01  W-I                                PIC 9(4) COMP VALUE 0.
       01  W-J                                PIC 9(4) COMP VALUE 0.
       01  W-RETURN-CODE                      PIC 9(4) COMP VALUE 0.
      *****************************************************************
      *    P R O C E D U R E  D I V I S I O N   S E C T I O N         *
      *****************************************************************
       PROCEDURE DIVISION.

      * ---------------------------------------------------------------
      * TEST TO CustomerData 
      * ---------------------------------------------------------------
           DISPLAY "TO-Hierarchy ======= 0 =============="
           PERFORM TEST-CUSTDATP THRU END-TEST-CUSTDATP.
           PERFORM TEST-CUSTDATW THRU END-TEST-CUSTDATW.
           
           GOBACK.

       TEST-CUSTDATP.
           DISPLAY 'TEST-CUSTDATP'.
           
           MOVE X'0a080a066368696c643212066368696c6433'
             TO PROTOBUF-BYTES.
           MOVE 18 TO PROTOBUF-BYTES-LEN.
           CALL 'CUSTDATP' USING PROTOBUF-BYTES
                                 PROTOBUF-BYTES-LEN
                                 CustomerData.
           DISPLAY 'child2=' child2.
           DISPLAY 'child3=' child3.
           
       END-TEST-CUSTDATP. EXIT.

       TEST-CUSTDATW.
           DISPLAY 'TEST-CUSTDATW'.
          
           MOVE LOW-VALUES TO PROTOBUF-BYTES.
           MOVE ZERO TO PROTOBUF-BYTES-LEN.
           CALL 'CUSTDATW' USING CustomerData
                                 PROTOBUF-BYTES
                                 PROTOBUF-BYTES-LEN.

           COMPUTE W-L = PROTOBUF-BYTES-LEN.
           CALL 'PBBA2HEX' USING W-L
                           PROTOBUF-BYTES
                           PROTOBUF-BYTES-HEX-STRING
           
           DISPLAY 'PROTOBUF-BYTES-LEN=' PROTOBUF-BYTES-LEN.
           DISPLAY 'PROTOBUF-BYTES=' PROTOBUF-BYTES-HEX-STRING.

       END-TEST-CUSTDATW. EXIT.

       END PROGRAM PBCTCUST.

