      * ----------------------------------------------------------------
      * Generated copybook for SearchRequest
      * ----------------------------------------------------------------
       01  SearchRequest.
           03  query PIC X(144) DISPLAY.
           03  page-number PIC S9(9) COMP-5.
           03  result-per-page PIC S9(9) COMP-5.