      * ----------------------------------------------------------------
      * Generated copybook for AllTypes
      * ----------------------------------------------------------------
       01  AllTypes.
           03  abool PIC 9(1) BINARY.
           03  astring PIC X(32) DISPLAY.
           03  adouble COMP-2.
           03  aenum PIC 9(4) COMP-5.
             88  UNIVERSAL VALUE 0.
             88  WEB VALUE 1.
             88  IMAGES VALUE 2.
             88  LOCAL VALUE 3.
             88  NEWS VALUE 4.
             88  PRODUCTS VALUE 5.
             88  VIDEO VALUE 6.
           03  afloat COMP-1.
           03  aint32 PIC S9(9) COMP-5.
           03  aint64 PIC S9(18) COMP-5.
           03  auint32 PIC 9(9) COMP-5.
           03  auint64 PIC 9(18) COMP-5.
