       IDENTIFICATION DIVISION.
       PROGRAM-ID. ALLTYPEP.
      *****************************************************************
      * OVERVIEW                                                      *
      * --------                                                      *
      * Subprogram that parses a protobuf byte stream and populates   *
      * a cobol structure.                                            *
      *                                                               *
      * This is generated code produced by protobuf-cobol.            *
      * It uses the PB4CBLIB protobuf-cobol library.                  *
      *                                                               *
      * Limits:                                                       *
      *    256 fields per message                                     *
      *    16777215 message byte length                               *
      *                                                               *
      *****************************************************************

       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SOURCE-COMPUTER. IBM-390 WITH DEBUGGING MODE.
       DATA DIVISION.
      *****************************************************************
      *        W O R K I N G    S T O R A G E    S E C T I O N        *
      *****************************************************************
       WORKING-STORAGE SECTION.

      *    // z/OS code page
       77  ZOS-CODEPAGE              PIC 9(4) COMP VALUE 1047.

      *    // Protobuf field key and type
       01  W-P-KEYTYPE.
           05  W-P-KEY               PIC 9(8) COMP-5.
           05  W-P-TYPE              PIC 9(4) COMP-5.
               88 VARINT             VALUE 0.
               88 FIXED-64           VALUE 1.
               88 LENGTH-DELIMITED   VALUE 2.
               88 FIXED-32           VALUE 5.
               88 VALID-WIRE-TYPE    VALUE 0, 1, 2, 5.

      *    // Tracks the current location in protobuf byte stream
       01  W-I                       PIC 9(8) COMP-5.

      *    // A pointer to the current protobuf byte stream location
       01  W-STREAM                  POINTER.

      *    // A double word binary to hold unsigned long integers
       01  W-Z-UINT64                PIC 9(18) COMP-5.

      *    // A single word binary to hold unsigned integers
       01  W-Z-UINT32                PIC 9(8) COMP-5.

      *    // A double word binary to hold signed long integers
       01  W-Z-INT64                 PIC S9(18) COMP-5.

      *    // A single word binary to hold signed integers
       01  W-Z-INT32                 PIC S9(8) COMP-5.

      *    // A simple floating point numeric
       01  W-Z-COMP-1                COMP-1.

      *    // A double floating point numeric
       01  W-Z-COMP-2                COMP-2.

      *    // Library calls return how many stream bytes were consumed
       01  W-BYTES-USED              PIC 9(8) COMP-5.




      *    // Conversion buffer for Strings
       01  W-UTF16-BUFFER            PIC N(32).

      *****************************************************************
      *        L I N K A G E    S E C T I O N                         *
      *****************************************************************
       LINKAGE SECTION.

      *    // The protobuf input byte stream
       01  PROTOBUF-BYTES            PIC X(16777215).

      *    // The protobuf input byte stream length
       01  PROTOBUF-BYTES-LEN        PIC 9(8) COMP-5.

      *    // The output COBOL structure
       01  AllTypes.
           03  abool PIC 9(4) BINARY.
           03  astring PIC X(32) DISPLAY.
           03  adouble COMP-2.
           03  aenum PIC 9(4) COMP-5.
             88  UNIVERSAL VALUE 0.
             88  WEB VALUE 1.
             88  IMAGES VALUE 2.
             88  LOCAL VALUE 3.
             88  NEWS VALUE 4.
             88  PRODUCTS VALUE 5.
             88  VIDEO VALUE 6.
           03  afloat COMP-1.
           03  aint32 PIC S9(9) COMP-5.
           03  aint64 PIC S9(18) COMP-5.
           03  auint32 PIC 9(9) COMP-5.
           03  auint64 PIC 9(18) COMP-5.
           03  asint32 PIC S9(9) COMP-5.
           03  asint64 PIC S9(18) COMP-5.
           03  afixed64 PIC 9(18) COMP-5.
           03  asfixed64 PIC S9(18) COMP-5.
           03  afixed32 PIC 9(9) COMP-5.
           03  asfixed32 PIC S9(9) COMP-5.


      *    // A protobuf variable integer
       01  P-VARINT                  PIC X(10).

      *    // A protobuf fixed 32 bits integer
       01  P-FIXED32                 PIC X(4).

      *    // A protobuf fixed 64 bits integer
       01  P-FIXED64                 PIC X(8).

      *    // A protobuf float (IEEE 754)
       01  P-FLOAT                   PIC X(4).

      *    // A protobuf double (IEEE 754)
       01  P-DOUBLE                  PIC X(8).

      *****************************************************************
      *    P R O C E D U R E  D I V I S I O N   S E C T I O N         *
      *****************************************************************
       PROCEDURE DIVISION USING
               PROTOBUF-BYTES,
               PROTOBUF-BYTES-LEN,
               AllTypes.
      *    // Parse the root protobuf message
           MOVE 1 TO W-I.
           PERFORM PARSE-AllTypes THRU
               END-PARSE-AllTypes
                   UNTIL W-I > PROTOBUF-BYTES-LEN.
           GOBACK.

      * ---------------------------------------------------------------
      * Parse the AllTypes message field
      * ---------------------------------------------------------------
       PARSE-AllTypes.
      D    DISPLAY 'PARSE-AllTypes OFFSET=' W-I.

           SET W-STREAM TO ADDRESS OF PROTOBUF-BYTES(W-I:).
           PERFORM GET-P-KEYTYPE THRU END-GET-P-KEYTYPE.
           ADD W-BYTES-USED TO W-I.

           SET W-STREAM TO ADDRESS OF PROTOBUF-BYTES(W-I:).
           EVALUATE W-P-KEY
               WHEN 1
                 PERFORM P-VARINT-TO-Z-UINT32 THRU
                     END-P-VARINT-TO-Z-UINT32
                 COMPUTE abool
                       = W-Z-UINT32
      D          DISPLAY 'abool ='
      D                   abool
      D                  ' ,AT OFFSET=' W-I
                 ADD W-BYTES-USED TO W-I
               WHEN 2
                 PERFORM P-VARINT-TO-Z-UINT32 THRU
                     END-P-VARINT-TO-Z-UINT32
                 ADD W-BYTES-USED TO W-I
                 MOVE FUNCTION NATIONAL-OF(
                    PROTOBUF-BYTES(W-I:W-Z-UINT32), 01208)
                    TO W-UTF16-BUFFER
                 MOVE FUNCTION DISPLAY-OF(W-UTF16-BUFFER, ZOS-CODEPAGE)
                    TO astring
                 COMPUTE W-BYTES-USED = W-Z-UINT32
      D          DISPLAY 'astring ='
      D                   astring
      D                  ' ,AT OFFSET=' W-I
                 ADD W-BYTES-USED TO W-I
               WHEN 3
                 PERFORM P-DOUBLE-TO-Z-COMP-2 THRU
                     END-P-DOUBLE-TO-Z-COMP-2
                 COMPUTE adouble
                       = W-Z-COMP-2
      D          DISPLAY 'adouble ='
      D                   adouble
      D                  ' ,AT OFFSET=' W-I
                 ADD W-BYTES-USED TO W-I
               WHEN 4
                 PERFORM P-VARINT-TO-Z-UINT32 THRU
                     END-P-VARINT-TO-Z-UINT32
                 COMPUTE aenum
                       = W-Z-UINT32
      D          DISPLAY 'aenum ='
      D                   aenum
      D                  ' ,AT OFFSET=' W-I
                 ADD W-BYTES-USED TO W-I
               WHEN 5
                 PERFORM P-FLOAT-TO-Z-COMP-1 THRU
                     END-P-FLOAT-TO-Z-COMP-1
                 COMPUTE afloat
                       = W-Z-COMP-1
      D          DISPLAY 'afloat ='
      D                   afloat
      D                  ' ,AT OFFSET=' W-I
                 ADD W-BYTES-USED TO W-I
               WHEN 6
                 PERFORM P-VARINT-TO-Z-INT32 THRU
                     END-P-VARINT-TO-Z-INT32
                 COMPUTE aint32
                       = W-Z-INT32
      D          DISPLAY 'aint32 ='
      D                   aint32
      D                  ' ,AT OFFSET=' W-I
                 ADD W-BYTES-USED TO W-I
               WHEN 7
                 PERFORM P-VARINT-TO-Z-INT64 THRU
                     END-P-VARINT-TO-Z-INT64
                 COMPUTE aint64
                       = W-Z-INT64
      D          DISPLAY 'aint64 ='
      D                   aint64
      D                  ' ,AT OFFSET=' W-I
                 ADD W-BYTES-USED TO W-I
               WHEN 8
                 PERFORM P-VARINT-TO-Z-UINT32 THRU
                     END-P-VARINT-TO-Z-UINT32
                 COMPUTE auint32
                       = W-Z-UINT32
      D          DISPLAY 'auint32 ='
      D                   auint32
      D                  ' ,AT OFFSET=' W-I
                 ADD W-BYTES-USED TO W-I
               WHEN 9
                 PERFORM P-VARINT-TO-Z-UINT64 THRU
                     END-P-VARINT-TO-Z-UINT64
                 COMPUTE auint64
                       = W-Z-UINT64
      D          DISPLAY 'auint64 ='
      D                   auint64
      D                  ' ,AT OFFSET=' W-I
                 ADD W-BYTES-USED TO W-I
               WHEN 10
                 PERFORM P-VARZIG-TO-Z-INT32 THRU
                     END-P-VARZIG-TO-Z-INT32
                 COMPUTE asint32
                       = W-Z-INT32
      D          DISPLAY 'asint32 ='
      D                   asint32
      D                  ' ,AT OFFSET=' W-I
                 ADD W-BYTES-USED TO W-I
               WHEN 11
                 PERFORM P-VARZIG-TO-Z-INT64 THRU
                     END-P-VARZIG-TO-Z-INT64
                 COMPUTE asint64
                       = W-Z-INT64
      D          DISPLAY 'asint64 ='
      D                   asint64
      D                  ' ,AT OFFSET=' W-I
                 ADD W-BYTES-USED TO W-I
               WHEN 12
                 PERFORM P-FIXED64-TO-Z-UINT64 THRU
                     END-P-FIXED64-TO-Z-UINT64
                 COMPUTE afixed64
                       = W-Z-UINT64
      D          DISPLAY 'afixed64 ='
      D                   afixed64
      D                  ' ,AT OFFSET=' W-I
                 ADD W-BYTES-USED TO W-I
               WHEN 13
                 PERFORM P-FIXED64-TO-Z-INT64 THRU
                     END-P-FIXED64-TO-Z-INT64
                 COMPUTE asfixed64
                       = W-Z-INT64
      D          DISPLAY 'asfixed64 ='
      D                   asfixed64
      D                  ' ,AT OFFSET=' W-I
                 ADD W-BYTES-USED TO W-I
               WHEN 14
                 PERFORM P-FIXED32-TO-Z-UINT32 THRU
                     END-P-FIXED32-TO-Z-UINT32
                 COMPUTE afixed32
                       = W-Z-UINT32
      D          DISPLAY 'afixed32 ='
      D                   afixed32
      D                  ' ,AT OFFSET=' W-I
                 ADD W-BYTES-USED TO W-I
               WHEN 15
                 PERFORM P-FIXED32-TO-Z-INT32 THRU
                     END-P-FIXED32-TO-Z-INT32
                 COMPUTE asfixed32
                       = W-Z-INT32
      D          DISPLAY 'asfixed32 ='
      D                   asfixed32
      D                  ' ,AT OFFSET=' W-I
                 ADD W-BYTES-USED TO W-I
           END-EVALUATE.
       END-PARSE-AllTypes. EXIT.



      * ---------------------------------------------------------------
      * Get a field key (identifier) and type from the stream.
      *
      * Field and Type are both encoded in a single variable integer.
      *
      * Field type is 3 lower bits of header varint, higher bits are
      * the field key (identifier)
      * ---------------------------------------------------------------
       GET-P-KEYTYPE.
           PERFORM P-VARINT-TO-Z-UINT64 THRU END-P-VARINT-TO-Z-UINT64.
           DIVIDE W-Z-UINT64 BY 8 GIVING W-P-KEY REMAINDER W-P-TYPE.
       END-GET-P-KEYTYPE. EXIT.

      * ---------------------------------------------------------------
      * Get a variable integer from the stream as unsigned double word
      * binary.
      * ---------------------------------------------------------------
       P-VARINT-TO-Z-UINT64.
           SET ADDRESS OF P-VARINT TO W-STREAM.
           CALL 'PBVI2U64' USING P-VARINT W-Z-UINT64 W-BYTES-USED.
       END-P-VARINT-TO-Z-UINT64. EXIT.

      * ---------------------------------------------------------------
      * Get a variable integer from the stream as unsigned single word
      * binary.
      * ---------------------------------------------------------------
       P-VARINT-TO-Z-UINT32.
           SET ADDRESS OF P-VARINT TO W-STREAM.
           CALL 'PBVI2U32' USING P-VARINT W-Z-UINT32 W-BYTES-USED.
       END-P-VARINT-TO-Z-UINT32. EXIT.

      * ---------------------------------------------------------------
      * Get a variable integer from the stream as signed double word
      * binary.
      * ---------------------------------------------------------------
       P-VARINT-TO-Z-INT64.
           SET ADDRESS OF P-VARINT TO W-STREAM.
           CALL 'PBVI2S64' USING P-VARINT W-Z-INT64 W-BYTES-USED.
       END-P-VARINT-TO-Z-INT64. EXIT.

      * ---------------------------------------------------------------
      * Get a variable integer from the stream as signed single word
      * binary.
      * ---------------------------------------------------------------
       P-VARINT-TO-Z-INT32.
           SET ADDRESS OF P-VARINT TO W-STREAM.
           CALL 'PBVI2S32' USING P-VARINT W-Z-INT32 W-BYTES-USED.
       END-P-VARINT-TO-Z-INT32. EXIT.

      * ---------------------------------------------------------------
      * Get a zigzag integer from the stream as signed single word
      * binary.
      * ---------------------------------------------------------------
       P-VARZIG-TO-Z-INT32.
           SET ADDRESS OF P-VARINT TO W-STREAM.
           CALL 'PBVZ2S32' USING P-VARINT W-Z-INT32 W-BYTES-USED.
       END-P-VARZIG-TO-Z-INT32. EXIT.

      * ---------------------------------------------------------------
      * Get a zigzag integer from the stream as signed double word
      * binary.
      * ---------------------------------------------------------------
       P-VARZIG-TO-Z-INT64.
           SET ADDRESS OF P-VARINT TO W-STREAM.
           CALL 'PBVZ2S64' USING P-VARINT W-Z-INT64 W-BYTES-USED.
       END-P-VARZIG-TO-Z-INT64. EXIT.

      * ---------------------------------------------------------------
      * Get a fixed integer from the stream as signed single word
      * signed binary.
      * ---------------------------------------------------------------
       P-FIXED32-TO-Z-INT32.
           SET ADDRESS OF P-FIXED32 TO W-STREAM.
           CALL 'PBFI2S32' USING P-FIXED32 W-Z-INT32 W-BYTES-USED.
       END-P-FIXED32-TO-Z-INT32. EXIT.

      * ---------------------------------------------------------------
      * Get a fixed integer from the stream as double single word
      * signed binary.
      * ---------------------------------------------------------------
       P-FIXED64-TO-Z-INT64.
           SET ADDRESS OF P-FIXED64 TO W-STREAM.
           CALL 'PBFI2S64' USING P-FIXED64 W-Z-INT64 W-BYTES-USED.
       END-P-FIXED64-TO-Z-INT64. EXIT.

      * ---------------------------------------------------------------
      * Get a fixed integer from the stream as unsigned single word
      * unsigned binary.
      * ---------------------------------------------------------------
       P-FIXED32-TO-Z-UINT32.
           SET ADDRESS OF P-FIXED32 TO W-STREAM.
           CALL 'PBFI2U32' USING P-FIXED32 W-Z-UINT32 W-BYTES-USED.
       END-P-FIXED32-TO-Z-UINT32. EXIT.

      * ---------------------------------------------------------------
      * Get a fixed integer from the stream as double single word
      * unsigned binary.
      * ---------------------------------------------------------------
       P-FIXED64-TO-Z-UINT64.
           SET ADDRESS OF P-FIXED64 TO W-STREAM.
           CALL 'PBFI2U64' USING P-FIXED64 W-Z-UINT64 W-BYTES-USED.
       END-P-FIXED64-TO-Z-UINT64. EXIT.

      * ---------------------------------------------------------------
      * Get a IEEE float from the stream as a COMP-1
      * ---------------------------------------------------------------
       P-FLOAT-TO-Z-COMP-1.
           SET ADDRESS OF P-FLOAT TO W-STREAM.
           CALL 'PB2ZFLOA' USING P-FLOAT W-Z-COMP-1 W-BYTES-USED.
       END-P-FLOAT-TO-Z-COMP-1. EXIT.

      * ---------------------------------------------------------------
      * Get a IEEE double from the stream as a COMP-2
      * ---------------------------------------------------------------
       P-DOUBLE-TO-Z-COMP-2.
           SET ADDRESS OF P-DOUBLE TO W-STREAM.
           CALL 'PB2ZDBLE' USING P-DOUBLE W-Z-COMP-2 W-BYTES-USED.
       END-P-DOUBLE-TO-Z-COMP-2. EXIT.

       END PROGRAM ALLTYPEP.