      * ----------------------------------------------------------------
      * Generated copybook for A
      * ----------------------------------------------------------------
       01  A.
           03  OCCURS-COUNTERS--C.
             05  B--C PIC 9(9) COMP-5.
             05  E--C PIC 9(9) COMP-5.
           03  B OCCURS 0 TO 10 DEPENDING ON B--C.
             05  C.
               07  d OCCURS 10 PIC X(32) DISPLAY.
           03  E OCCURS 0 TO 10 DEPENDING ON E--C.
             05  f PIC X(32) DISPLAY.
