       PROCESS ARITH(EXTEND)
       IDENTIFICATION DIVISION.
       PROGRAM-ID. PBCTSV32.
      *****************************************************************
      * OVERVIEW                                                      *
      * --------                                                      *
      * TEST SIGNED INTEGER 32 BITS <> VARIABLE INTEGER               *
      *****************************************************************

       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       DATA DIVISION.
      *****************************************************************
      *        W O R K I N G    S T O R A G E    S E C T I O N        *
      *****************************************************************
       WORKING-STORAGE SECTION.
       01  W-PB-VARINT                       PIC X(10).
       01  W-ZOS-SINT32                      PIC S9(8) COMP-5.
       01  W-BYTES-USED                      PIC 9(8) COMP-5.

       01  W-EXPECTED-PB-VARINT              PIC X(10).
       01  W-EXPECTED-ZOS-SINT32             PIC S9(8) COMP-5.

       01  W-PB-VARINT-ARRAY-LEN             PIC 9(4) COMP-5 VALUE 10.
       01  W-PB-VARINT-HEX-STRING            PIC X(20).

       01  W-RETURN-CODE                      PIC 9(4) COMP VALUE 0.
      *****************************************************************
      *    P R O C E D U R E  D I V I S I O N   S E C T I O N         *
      *****************************************************************
       PROCEDURE DIVISION.

      * ---------------------------------------------------------------
      * TEST TO ZOS Signed Int 32
      * ---------------------------------------------------------------
           DISPLAY "TO-ZOSSINT32 ======= 0 =============="
           MOVE X'00000000000000000000' TO W-PB-VARINT.
           MOVE 0 to W-EXPECTED-ZOS-SINT32.
           PERFORM TEST-PBVI2S32 THRU END-TEST-PBVI2S32.
           
           DISPLAY "TO-ZOSSINT32 ======= 1 =============="
           MOVE X'01000000000000000000' TO W-PB-VARINT.
           MOVE 1 to W-EXPECTED-ZOS-SINT32.
           PERFORM TEST-PBVI2S32 THRU END-TEST-PBVI2S32.

           DISPLAY "TO-ZOSSINT32 ======= -1 =============="
           MOVE X'FFFFFFFFFFFFFFFFFF01' TO W-PB-VARINT.
           MOVE -1 to W-EXPECTED-ZOS-SINT32.
           PERFORM TEST-PBVI2S32 THRU END-TEST-PBVI2S32.

           DISPLAY "TO-ZOSSINT32 ======= 300 =============="
           MOVE X'AC020000000000000000' TO W-PB-VARINT.
           MOVE 300 to W-EXPECTED-ZOS-SINT32.
           PERFORM TEST-PBVI2S32 THRU END-TEST-PBVI2S32.

           DISPLAY "TO-ZOSSINT32 ======= -300 =============="
           MOVE X'D4FDFFFFFFFFFFFFFF01' TO W-PB-VARINT.
           MOVE -300 to W-EXPECTED-ZOS-SINT32.
           PERFORM TEST-PBVI2S32 THRU END-TEST-PBVI2S32.

           DISPLAY "TO-ZOSSINT32 ======= 45483 =============="
           MOVE X'ABE30200000000000000' TO W-PB-VARINT.
           MOVE 45483 to W-EXPECTED-ZOS-SINT32.
           PERFORM TEST-PBVI2S32 THRU END-TEST-PBVI2S32.

           DISPLAY "TO-ZOSSINT32 ======= -45483 =============="
           MOVE X'D59CFDFFFFFFFFFFFF01' TO W-PB-VARINT.
           MOVE -45483 to W-EXPECTED-ZOS-SINT32.
           PERFORM TEST-PBVI2S32 THRU END-TEST-PBVI2S32.

           DISPLAY "TO-ZOSSINT32 == 2147483647 ====="
           MOVE X'FFFFFFFF070000000000' TO W-PB-VARINT.
           MOVE 2147483647 to W-EXPECTED-ZOS-SINT32.
           PERFORM TEST-PBVI2S32 THRU END-TEST-PBVI2S32.

           DISPLAY "TO-ZOSSINT32 == -2147483648 ====="
           MOVE X'80808080F8FFFFFFFF01' TO W-PB-VARINT.
           MOVE -2147483648 to W-EXPECTED-ZOS-SINT32.
           PERFORM TEST-PBVI2S32 THRU END-TEST-PBVI2S32.

      * ---------------------------------------------------------------
      * TEST TO PROTOBUF Signed Int 32
      * ---------------------------------------------------------------
           DISPLAY "TO-PB-VARINT ========== 0 =========="
           COMPUTE W-ZOS-SINT32 = 0.
           MOVE X'00000000000000000000' to W-EXPECTED-PB-VARINT.
           PERFORM TEST-PBS322VI THRU END-TEST-PBS322VI.

           DISPLAY "TO-PB-VARINT ========== 1 =========="
           COMPUTE W-ZOS-SINT32 = 1.
           MOVE X'01000000000000000000' to W-EXPECTED-PB-VARINT.
           PERFORM TEST-PBS322VI THRU END-TEST-PBS322VI.

           DISPLAY "TO-PB-VARINT ========== -1 =========="
           COMPUTE W-ZOS-SINT32 = -1.
           MOVE X'FFFFFFFFFFFFFFFFFF01' to W-EXPECTED-PB-VARINT.
           PERFORM TEST-PBS322VI THRU END-TEST-PBS322VI.

           DISPLAY "TO-PB-VARINT ========== 300 =========="
           COMPUTE W-ZOS-SINT32 = 300.
           MOVE X'AC020000000000000000' to W-EXPECTED-PB-VARINT.
           PERFORM TEST-PBS322VI THRU END-TEST-PBS322VI.

           DISPLAY "TO-PB-VARINT ========== -300 =========="
           COMPUTE W-ZOS-SINT32 = -300.
           MOVE X'D4FDFFFFFFFFFFFFFF01' to W-EXPECTED-PB-VARINT.
           PERFORM TEST-PBS322VI THRU END-TEST-PBS322VI.

           DISPLAY "TO-PB-VARINT ========== 45483 =========="
           COMPUTE W-ZOS-SINT32 = 45483.
           MOVE X'ABE30200000000000000' to W-EXPECTED-PB-VARINT.
           PERFORM TEST-PBS322VI THRU END-TEST-PBS322VI.

           DISPLAY "TO-PB-VARINT ========== -45483 =========="
           COMPUTE W-ZOS-SINT32 = -45483.
           MOVE X'D59CFDFFFFFFFFFFFF01' to W-EXPECTED-PB-VARINT.
           PERFORM TEST-PBS322VI THRU END-TEST-PBS322VI.

           DISPLAY "TO-PB-VARINT == 2147483647 ====="
           COMPUTE W-ZOS-SINT32 = 2147483647.
           MOVE X'FFFFFFFF070000000000' to W-EXPECTED-PB-VARINT.
           PERFORM TEST-PBS322VI THRU END-TEST-PBS322VI.

           DISPLAY "TO-PB-VARINT == -2147483648 ====="
           COMPUTE W-ZOS-SINT32 = -2147483648.
           MOVE X'80808080F8FFFFFFFF01' to W-EXPECTED-PB-VARINT.
           PERFORM TEST-PBS322VI THRU END-TEST-PBS322VI.

           MOVE W-RETURN-CODE to RETURN-CODE.
           GOBACK.

       TEST-PBVI2S32.
           CALL 'PBVI2S32' USING W-PB-VARINT W-ZOS-SINT32 W-BYTES-USED.
           IF W-ZOS-SINT32 NOT = W-EXPECTED-ZOS-SINT32
              DISPLAY 'ERROR: ZOS-SINT32'
              DISPLAY '    RESULT  : ' W-ZOS-SINT32
              DISPLAY '    EXPECTED: ' W-EXPECTED-ZOS-SINT32
              MOVE 8 TO W-RETURN-CODE
           ELSE
              DISPLAY 'OK'
           END-IF.
       END-TEST-PBVI2S32. EXIT.

       TEST-PBS322VI.
           MOVE LOW-VALUES TO W-PB-VARINT.
           CALL 'PBS322VI' USING W-ZOS-SINT32 W-PB-VARINT W-BYTES-USED.
           IF W-PB-VARINT NOT = W-EXPECTED-PB-VARINT
              DISPLAY 'ERROR: PB-VARINT'
              CALL 'PBBA2HEX' USING W-PB-VARINT-ARRAY-LEN
                              W-PB-VARINT
                              W-PB-VARINT-HEX-STRING
              DISPLAY '    RESULT  : ' W-PB-VARINT-HEX-STRING
              CALL 'PBBA2HEX' USING W-PB-VARINT-ARRAY-LEN
                              W-EXPECTED-PB-VARINT
                              W-PB-VARINT-HEX-STRING
              DISPLAY '    EXPECTED: ' W-PB-VARINT-HEX-STRING
              MOVE 8 TO W-RETURN-CODE
           ELSE
              DISPLAY 'OK'
           END-IF.
       END-TEST-PBS322VI. EXIT.

       END PROGRAM PBCTSV32.

