       IDENTIFICATION DIVISION.
       PROGRAM-ID. PBCTSIMP.
      *****************************************************************
      * OVERVIEW                                                      *
      * --------                                                      *
      * TEST GENERATED PROGRAMS FOR: simple.proto                     *
      *****************************************************************

       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       DATA DIVISION.
      *****************************************************************
      *        W O R K I N G    S T O R A G E    S E C T I O N        *
      *****************************************************************
       WORKING-STORAGE SECTION.
       01  PROTOBUF-BYTES                    PIC X(4096).
       01  PROTOBUF-BYTES-LEN                PIC 9(8) COMP-5.
       01  W-BYTES-USED                      PIC 9(8) COMP-5.

      *    // The output COBOL structure
       01  SearchRequest.
           03  query PIC X(32) DISPLAY.
           03  page-number PIC S9(9) COMP-5.
           03  result-per-page PIC S9(9) COMP-5.

       01  W-RETURN-CODE                      PIC 9(4) COMP VALUE 0.
      *****************************************************************
      *    P R O C E D U R E  D I V I S I O N   S E C T I O N         *
      *****************************************************************
       PROCEDURE DIVISION.

      * ---------------------------------------------------------------
      * TEST TO SearchRequest 
      * ---------------------------------------------------------------
           DISPLAY "TO-SearchRequest ======= 0 =============="
           MOVE X'0a084a6f686e20446f651005180a' TO PROTOBUF-BYTES.
           MOVE 14 TO PROTOBUF-BYTES-LEN.
           PERFORM TEST-SEARREQP THRU END-TEST-SEARREQP.
           
           GOBACK.

       TEST-SEARREQP.
           CALL 'SEARREQP' USING PROTOBUF-BYTES
                                 PROTOBUF-BYTES-LEN
                                 SearchRequest.
           DISPLAY 'query=' query.
           DISPLAY 'page-number=' page-number.
           DISPLAY 'result-per-page=' result-per-page.
           
       END-TEST-SEARREQP. EXIT.

       END PROGRAM PBCTSIMP.

