       PROCESS ARITH(EXTEND)
       IDENTIFICATION DIVISION.
       PROGRAM-ID. PBCTUV32.
      *****************************************************************
      * OVERVIEW                                                      *
      * --------                                                      *
      * TEST UNSIGNED INTEGER 32 BITS <> VARIABLE INTEGER             *
      *****************************************************************

       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       DATA DIVISION.
      *****************************************************************
      *        W O R K I N G    S T O R A G E    S E C T I O N        *
      *****************************************************************
       WORKING-STORAGE SECTION.
       01  W-PB-VARINT                       PIC X(10).
       01  W-ZOS-UINT32                      PIC 9(8) COMP-5.
       01  W-BYTES-USED                      PIC 9(8) COMP-5.

       01  W-EXPECTED-PB-VARINT              PIC X(10).
       01  W-EXPECTED-ZOS-UINT32             PIC 9(8) COMP-5.

       01  W-PB-VARINT-ARRAY-LEN             PIC 9(4) COMP-5 VALUE 10.
       01  W-PB-VARINT-HEX-STRING            PIC X(20).

       01  W-RETURN-CODE                      PIC 9(4) COMP VALUE 0.
      *****************************************************************
      *    P R O C E D U R E  D I V I S I O N   S E C T I O N         *
      *****************************************************************
       PROCEDURE DIVISION.

      * ---------------------------------------------------------------
      * TEST TO ZOS Unsigned Int 32
      * ---------------------------------------------------------------
           DISPLAY "TO-ZOSUINT32 ======= 0 =============="
           MOVE X'00000000000000000000' TO W-PB-VARINT.
           MOVE 0 to W-EXPECTED-ZOS-UINT32.
           PERFORM TEST-PBVI2U32 THRU END-TEST-PBVI2U32.
           
           DISPLAY "TO-ZOSUINT32 ======= 1 =============="
           MOVE X'01000000000000000000' TO W-PB-VARINT.
           MOVE 1 to W-EXPECTED-ZOS-UINT32.
           PERFORM TEST-PBVI2U32 THRU END-TEST-PBVI2U32.

           DISPLAY "TO-ZOSUINT32 ======= 300 =============="
           MOVE X'AC020000000000000000' TO W-PB-VARINT.
           MOVE 300 to W-EXPECTED-ZOS-UINT32.
           PERFORM TEST-PBVI2U32 THRU END-TEST-PBVI2U32.

           DISPLAY "TO-ZOSUINT32 ======= 45483 =============="
           MOVE X'ABE30200000000000000' TO W-PB-VARINT.
           MOVE 45483 to W-EXPECTED-ZOS-UINT32.
           PERFORM TEST-PBVI2U32 THRU END-TEST-PBVI2U32.

           DISPLAY "TO-ZOSUINT32 == 2147483647 ====="
           MOVE X'FFFFFFFF070000000000' TO W-PB-VARINT.
           MOVE 2147483647 to W-EXPECTED-ZOS-UINT32.
           PERFORM TEST-PBVI2U32 THRU END-TEST-PBVI2U32.

      * ---------------------------------------------------------------
      * TEST TO PROTOBUF Unsigned Int 32
      * ---------------------------------------------------------------
           DISPLAY "TO-PB-VARINT ========== 0 =========="
           COMPUTE W-ZOS-UINT32 = 0.
           MOVE X'00000000000000000000' to W-EXPECTED-PB-VARINT.
           PERFORM TEST-PBU322VI THRU END-TEST-PBU322VI.

           DISPLAY "TO-PB-VARINT ========== 1 =========="
           COMPUTE W-ZOS-UINT32 = 1.
           MOVE X'01000000000000000000' to W-EXPECTED-PB-VARINT.
           PERFORM TEST-PBU322VI THRU END-TEST-PBU322VI.

           DISPLAY "TO-PB-VARINT ========== 300 =========="
           COMPUTE W-ZOS-UINT32 = 300.
           MOVE X'AC020000000000000000' to W-EXPECTED-PB-VARINT.
           PERFORM TEST-PBU322VI THRU END-TEST-PBU322VI.

           DISPLAY "TO-PB-VARINT ========== 45483 =========="
           COMPUTE W-ZOS-UINT32 = 45483.
           MOVE X'ABE30200000000000000' to W-EXPECTED-PB-VARINT.
           PERFORM TEST-PBU322VI THRU END-TEST-PBU322VI.

           DISPLAY "TO-PB-VARINT == 2147483647 ====="
           COMPUTE W-ZOS-UINT32 = 2147483647.
           MOVE X'FFFFFFFF070000000000' to W-EXPECTED-PB-VARINT.
           PERFORM TEST-PBU322VI THRU END-TEST-PBU322VI.

           MOVE W-RETURN-CODE to RETURN-CODE.
           GOBACK.

       TEST-PBVI2U32.
           CALL 'PBVI2U32' USING W-PB-VARINT W-ZOS-UINT32 W-BYTES-USED.
           IF W-ZOS-UINT32 NOT = W-EXPECTED-ZOS-UINT32
              DISPLAY 'ERROR: ZOS-UINT32'
              DISPLAY '    RESULT  : ' W-ZOS-UINT32
              DISPLAY '    EXPECTED: ' W-EXPECTED-ZOS-UINT32
              MOVE 8 TO W-RETURN-CODE
           ELSE
              DISPLAY 'OK'
           END-IF.
       END-TEST-PBVI2U32. EXIT.

       TEST-PBU322VI.
           MOVE LOW-VALUES TO W-PB-VARINT.
           CALL 'PBU322VI' USING W-ZOS-UINT32 W-PB-VARINT W-BYTES-USED.
           IF W-PB-VARINT NOT = W-EXPECTED-PB-VARINT
              DISPLAY 'ERROR: PB-VARINT'
              CALL 'PBBA2HEX' USING W-PB-VARINT-ARRAY-LEN
                              W-PB-VARINT
                              W-PB-VARINT-HEX-STRING
              DISPLAY '    RESULT  : ' W-PB-VARINT-HEX-STRING
              CALL 'PBBA2HEX' USING W-PB-VARINT-ARRAY-LEN
                              W-EXPECTED-PB-VARINT
                              W-PB-VARINT-HEX-STRING
              DISPLAY '    EXPECTED: ' W-PB-VARINT-HEX-STRING
              MOVE 8 TO W-RETURN-CODE
           ELSE
              DISPLAY 'OK'
           END-IF.
       END-TEST-PBU322VI. EXIT.

       END PROGRAM PBCTUV32.

