       IDENTIFICATION DIVISION.
       PROGRAM-ID. ADDRBOOP.
      *****************************************************************
      * OVERVIEW                                                      *
      * --------                                                      *
      * Subprogram that parses a protobuf byte stream and populates   *
      * a cobol structure.                                            *
      *                                                               *
      * This is generated code produced by protobuf-cobol.            *
      * It uses the PB4CBLIB protobuf-cobol library.                  *
      *                                                               *
      * Limits:                                                       *
      *    256 fields per message                                     *
      *    65536 message byte length                                  *
      *                                                               *
      *****************************************************************

       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
      *SOURCE-COMPUTER. IBM-390 WITH DEBUGGING MODE.
       DATA DIVISION.
      *****************************************************************
      *        W O R K I N G    S T O R A G E    S E C T I O N        *
      *****************************************************************
       WORKING-STORAGE SECTION.

      *    // z/OS code page
       77  ZOS-CODEPAGE              PIC 9(4) COMP VALUE 1047.

      *    // Protobuf field key and type
       01  W-P-KEYTYPE.
           05  W-P-KEY               PIC 9(8) COMP-5.
           05  W-P-TYPE              PIC 9(4) COMP-5.
               88 VARINT             VALUE 0.
               88 FIXED-64           VALUE 1.
               88 LENGTH-DELIMITED   VALUE 2.
               88 FIXED-32           VALUE 5.
               88 VALID-WIRE-TYPE    VALUE 0, 1, 2, 5.

      *    // Tracks the current location in protobuf byte stream
       01  W-I                       PIC 9(8) COMP-5.

      *    // A pointer to the current protobuf byte stream location
       01  W-STREAM                  POINTER.

      *    // A double word binary to hold unsigned long integers
       01  W-Z-UINT64                PIC 9(18) COMP-5.

      *    // A single word binary to hold unsigned integers
       01  W-Z-UINT32                PIC 9(8) COMP-5.

      *    // A double word binary to hold signed long integers
       01  W-Z-INT64                 PIC S9(18) COMP-5.

      *    // A single word binary to hold signed integers
       01  W-Z-INT32                 PIC S9(8) COMP-5.

      *    // A simple floating point numeric
       01  W-Z-COMP-1                COMP-1.

      *    // A double floating point numeric
       01  W-Z-COMP-2                COMP-2.

      *    // Library calls return how many stream bytes were consumed
       01  W-BYTES-USED              PIC 9(8) COMP-5.


      *    // Sub-messages maximum offset from input start
       01  W-Person-L     PIC 9(8) COMP-5.
       01  W-PhoneNumber-L     PIC 9(8) COMP-5.

      *    // Array indexes
       01  W-Person-I     PIC 9(8) COMP-5.
       01  W-PhoneNumber-I     PIC 9(8) COMP-5.

      *    // Conversion buffer for Strings
       01  W-UTF16-BUFFER            PIC N(32).

      *****************************************************************
      *        L I N K A G E    S E C T I O N                         *
      *****************************************************************
       LINKAGE SECTION.

      *    // The protobuf input byte stream
       01  PROTOBUF-BYTES            PIC X(65536).

      *    // The protobuf input byte stream length
       01  PROTOBUF-BYTES-LEN        PIC 9(8) COMP-5.

      *    // The output COBOL structure
       01  AddressBook.
           03  OCCURS-COUNTERS--C.
             05  Person--C PIC 9(9) COMP-5.
           03  Person OCCURS 0 TO 10 DEPENDING ON Person--C.
             05  name PIC X(32) DISPLAY.
             05  R-id PIC S9(9) COMP-5.
             05  email PIC X(32) DISPLAY.
             05  PhoneNumber OCCURS 10.
               07  R-number PIC X(32) DISPLAY.
               07  R-type PIC 9(4) COMP-5.
                 88  MOBILE VALUE 0.
                 88  HOME VALUE 1.
                 88  WORK VALUE 2.


      *    // A protobuf variable integer
       01  P-VARINT                  PIC X(10).

      *    // A protobuf fixed 32 bits integer
       01  P-FIXED32                 PIC X(4).

      *    // A protobuf fixed 64 bits integer
       01  P-FIXED64                 PIC X(8).

      *    // A protobuf float (IEEE 754)
       01  P-FLOAT                   PIC X(4).

      *    // A protobuf double (IEEE 754)
       01  P-DOUBLE                  PIC X(8).

      *****************************************************************
      *    P R O C E D U R E  D I V I S I O N   S E C T I O N         *
      *****************************************************************
       PROCEDURE DIVISION USING
               PROTOBUF-BYTES,
               PROTOBUF-BYTES-LEN,
               AddressBook.
      *    // Parse the root protobuf message
           MOVE ZERO TO W-Person-I.
           MOVE 1 TO W-I.
           PERFORM PARSE-AddressBook THRU
               END-PARSE-AddressBook
                   UNTIL W-I > PROTOBUF-BYTES-LEN.
           GOBACK.

      * ---------------------------------------------------------------
      * Parse the AddressBook message field
      * ---------------------------------------------------------------
       PARSE-AddressBook.
      D    DISPLAY 'PARSE-AddressBook OFFSET=' W-I.

           SET W-STREAM TO ADDRESS OF PROTOBUF-BYTES(W-I:).
           PERFORM GET-P-KEYTYPE THRU END-GET-P-KEYTYPE.
           ADD W-BYTES-USED TO W-I.

           SET W-STREAM TO ADDRESS OF PROTOBUF-BYTES(W-I:).
           EVALUATE W-P-KEY
               WHEN 1
                 ADD 1 TO W-Person-I
                 MOVE W-Person-I TO Person--C
                 MOVE ZERO TO W-PhoneNumber-I
                 PERFORM P-VARINT-TO-Z-UINT32 THRU
                     END-P-VARINT-TO-Z-UINT32
                 ADD W-BYTES-USED TO W-I
                 COMPUTE W-Person-L = W-I + W-Z-UINT32 - 1
                 PERFORM PARSE-Person THRU
                     END-PARSE-Person
                         UNTIL W-I > W-Person-L
           END-EVALUATE.
       END-PARSE-AddressBook. EXIT.

      * ---------------------------------------------------------------
      * Parse the Person message field
      * ---------------------------------------------------------------
       PARSE-Person.
      D    DISPLAY 'PARSE-Person OFFSET=' W-I.

           SET W-STREAM TO ADDRESS OF PROTOBUF-BYTES(W-I:).
           PERFORM GET-P-KEYTYPE THRU END-GET-P-KEYTYPE.
           ADD W-BYTES-USED TO W-I.

           SET W-STREAM TO ADDRESS OF PROTOBUF-BYTES(W-I:).
           EVALUATE W-P-KEY
               WHEN 1
                 PERFORM P-VARINT-TO-Z-UINT32 THRU
                     END-P-VARINT-TO-Z-UINT32
                 ADD W-BYTES-USED TO W-I
                 MOVE FUNCTION NATIONAL-OF(
                    PROTOBUF-BYTES(W-I:W-Z-UINT32), 01208)
                    TO W-UTF16-BUFFER
                 MOVE FUNCTION DISPLAY-OF(W-UTF16-BUFFER, ZOS-CODEPAGE)
                    TO name(W-Person-I)
                 COMPUTE W-BYTES-USED = W-Z-UINT32
      D          DISPLAY 'name(W-Person-I) ='
      D                   name(W-Person-I)
      D                  ' ,AT OFFSET=' W-I
                 ADD W-BYTES-USED TO W-I
               WHEN 2
                 PERFORM P-VARINT-TO-Z-INT32 THRU
                     END-P-VARINT-TO-Z-INT32
                 COMPUTE R-id(W-Person-I)
                       = W-Z-INT32
      D          DISPLAY 'R-id(W-Person-I) ='
      D                   R-id(W-Person-I)
      D                  ' ,AT OFFSET=' W-I
                 ADD W-BYTES-USED TO W-I
               WHEN 3
                 PERFORM P-VARINT-TO-Z-UINT32 THRU
                     END-P-VARINT-TO-Z-UINT32
                 ADD W-BYTES-USED TO W-I
                 MOVE FUNCTION NATIONAL-OF(
                    PROTOBUF-BYTES(W-I:W-Z-UINT32), 01208)
                    TO W-UTF16-BUFFER
                 MOVE FUNCTION DISPLAY-OF(W-UTF16-BUFFER, ZOS-CODEPAGE)
                    TO email(W-Person-I)
                 COMPUTE W-BYTES-USED = W-Z-UINT32
      D          DISPLAY 'email(W-Person-I) ='
      D                   email(W-Person-I)
      D                  ' ,AT OFFSET=' W-I
                 ADD W-BYTES-USED TO W-I
               WHEN 4
                 ADD 1 TO W-PhoneNumber-I

                 PERFORM P-VARINT-TO-Z-UINT32 THRU
                     END-P-VARINT-TO-Z-UINT32
                 ADD W-BYTES-USED TO W-I
                 COMPUTE W-PhoneNumber-L = W-I + W-Z-UINT32 - 1
                 PERFORM PARSE-PhoneNumber THRU
                     END-PARSE-PhoneNumber
                         UNTIL W-I > W-PhoneNumber-L
           END-EVALUATE.
       END-PARSE-Person. EXIT.

      * ---------------------------------------------------------------
      * Parse the PhoneNumber message field
      * ---------------------------------------------------------------
       PARSE-PhoneNumber.
      D    DISPLAY 'PARSE-PhoneNumber OFFSET=' W-I.

           SET W-STREAM TO ADDRESS OF PROTOBUF-BYTES(W-I:).
           PERFORM GET-P-KEYTYPE THRU END-GET-P-KEYTYPE.
           ADD W-BYTES-USED TO W-I.

           SET W-STREAM TO ADDRESS OF PROTOBUF-BYTES(W-I:).
           EVALUATE W-P-KEY
               WHEN 1
                 PERFORM P-VARINT-TO-Z-UINT32 THRU
                     END-P-VARINT-TO-Z-UINT32
                 ADD W-BYTES-USED TO W-I
                 MOVE FUNCTION NATIONAL-OF(
                    PROTOBUF-BYTES(W-I:W-Z-UINT32), 01208)
                    TO W-UTF16-BUFFER
                 MOVE FUNCTION DISPLAY-OF(W-UTF16-BUFFER, ZOS-CODEPAGE)
                    TO R-number(W-Person-I, W-PhoneNumber-I)
                 COMPUTE W-BYTES-USED = W-Z-UINT32
      D          DISPLAY 'R-number(W-Person-I, W-PhoneNumber-I) ='
      D                   R-number(W-Person-I, W-PhoneNumber-I)
      D                  ' ,AT OFFSET=' W-I
                 ADD W-BYTES-USED TO W-I
               WHEN 2
                 PERFORM P-VARINT-TO-Z-UINT32 THRU
                     END-P-VARINT-TO-Z-UINT32
                 COMPUTE R-type(W-Person-I, W-PhoneNumber-I)
                       = W-Z-UINT32
      D          DISPLAY 'R-type(W-Person-I, W-PhoneNumber-I) ='
      D                   R-type(W-Person-I, W-PhoneNumber-I)
      D                  ' ,AT OFFSET=' W-I
                 ADD W-BYTES-USED TO W-I
           END-EVALUATE.
       END-PARSE-PhoneNumber. EXIT.



      * ---------------------------------------------------------------
      * Get a field key (identifier) and type from the stream.
      *
      * Field and Type are both encoded in a single variable integer.
      *
      * Field type is 3 lower bits of header varint, higher bits are
      * the field key (identifier)
      * ---------------------------------------------------------------
       GET-P-KEYTYPE.
           PERFORM P-VARINT-TO-Z-UINT64 THRU END-P-VARINT-TO-Z-UINT64.
           DIVIDE W-Z-UINT64 BY 8 GIVING W-P-KEY REMAINDER W-P-TYPE.
       END-GET-P-KEYTYPE. EXIT.

      * ---------------------------------------------------------------
      * Get a variable integer from the stream as unsigned double word
      * binary.
      * ---------------------------------------------------------------
       P-VARINT-TO-Z-UINT64.
           SET ADDRESS OF P-VARINT TO W-STREAM.
           CALL 'PBVI2U64' USING P-VARINT W-Z-UINT64 W-BYTES-USED.
       END-P-VARINT-TO-Z-UINT64. EXIT.

      * ---------------------------------------------------------------
      * Get a variable integer from the stream as unsigned single word
      * binary.
      * ---------------------------------------------------------------
       P-VARINT-TO-Z-UINT32.
           SET ADDRESS OF P-VARINT TO W-STREAM.
           CALL 'PBVI2U32' USING P-VARINT W-Z-UINT32 W-BYTES-USED.
       END-P-VARINT-TO-Z-UINT32. EXIT.

      * ---------------------------------------------------------------
      * Get a variable integer from the stream as signed double word
      * binary.
      * ---------------------------------------------------------------
       P-VARINT-TO-Z-INT64.
           SET ADDRESS OF P-VARINT TO W-STREAM.
           CALL 'PBVI2S64' USING P-VARINT W-Z-INT64 W-BYTES-USED.
       END-P-VARINT-TO-Z-INT64. EXIT.

      * ---------------------------------------------------------------
      * Get a variable integer from the stream as signed single word
      * binary.
      * ---------------------------------------------------------------
       P-VARINT-TO-Z-INT32.
           SET ADDRESS OF P-VARINT TO W-STREAM.
           CALL 'PBVI2S32' USING P-VARINT W-Z-INT32 W-BYTES-USED.
       END-P-VARINT-TO-Z-INT32. EXIT.

      * ---------------------------------------------------------------
      * Get a zigzag integer from the stream as signed single word
      * binary.
      * ---------------------------------------------------------------
       P-VARZIG-TO-Z-INT32.
           SET ADDRESS OF P-VARINT TO W-STREAM.
           CALL 'PBVZ2S32' USING P-VARINT W-Z-INT32 W-BYTES-USED.
       END-P-VARZIG-TO-Z-INT32. EXIT.

      * ---------------------------------------------------------------
      * Get a zigzag integer from the stream as signed double word
      * binary.
      * ---------------------------------------------------------------
       P-VARZIG-TO-Z-INT64.
           SET ADDRESS OF P-VARINT TO W-STREAM.
           CALL 'PBVZ2S64' USING P-VARINT W-Z-INT64 W-BYTES-USED.
       END-P-VARZIG-TO-Z-INT64. EXIT.

      * ---------------------------------------------------------------
      * Get a fixed integer from the stream as signed single word
      * signed binary.
      * ---------------------------------------------------------------
       P-FIXED32-TO-Z-INT32.
           SET ADDRESS OF P-FIXED32 TO W-STREAM.
           CALL 'PBFI2S32' USING P-FIXED32 W-Z-INT32 W-BYTES-USED.
       END-P-FIXED32-TO-Z-INT32. EXIT.

      * ---------------------------------------------------------------
      * Get a fixed integer from the stream as double single word
      * signed binary.
      * ---------------------------------------------------------------
       P-FIXED64-TO-Z-INT64.
           SET ADDRESS OF P-FIXED64 TO W-STREAM.
           CALL 'PBFI2S64' USING P-FIXED64 W-Z-INT64 W-BYTES-USED.
       END-P-FIXED64-TO-Z-INT64. EXIT.

      * ---------------------------------------------------------------
      * Get a fixed integer from the stream as unsigned single word
      * unsigned binary.
      * ---------------------------------------------------------------
       P-FIXED32-TO-Z-UINT32.
           SET ADDRESS OF P-FIXED32 TO W-STREAM.
           CALL 'PBFI2U32' USING P-FIXED32 W-Z-UINT32 W-BYTES-USED.
       END-P-FIXED32-TO-Z-UINT32. EXIT.

      * ---------------------------------------------------------------
      * Get a fixed integer from the stream as double single word
      * unsigned binary.
      * ---------------------------------------------------------------
       P-FIXED64-TO-Z-UINT64.
           SET ADDRESS OF P-FIXED64 TO W-STREAM.
           CALL 'PBFI2U64' USING P-FIXED64 W-Z-UINT64 W-BYTES-USED.
       END-P-FIXED64-TO-Z-UINT64. EXIT.

      * ---------------------------------------------------------------
      * Get a IEEE float from the stream as a COMP-1
      * ---------------------------------------------------------------
       P-FLOAT-TO-Z-COMP-1.
           SET ADDRESS OF P-FLOAT TO W-STREAM.
           CALL 'PB2ZFLOA' USING P-FLOAT W-Z-COMP-1 W-BYTES-USED.
       END-P-FLOAT-TO-Z-COMP-1. EXIT.

      * ---------------------------------------------------------------
      * Get a IEEE double from the stream as a COMP-2
      * ---------------------------------------------------------------
       P-DOUBLE-TO-Z-COMP-2.
           SET ADDRESS OF P-DOUBLE TO W-STREAM.
           CALL 'PB2ZDBLE' USING P-DOUBLE W-Z-COMP-2 W-BYTES-USED.
       END-P-DOUBLE-TO-Z-COMP-2. EXIT.

       END PROGRAM ADDRBOOP.