      * ----------------------------------------------------------------
      * Generated copybook for Person
      * ----------------------------------------------------------------
       01  Person.
           03  OCCURS-COUNTERS--C.
             05  PhoneNumber--C PIC 9(9) COMP-5.
           03  name PIC X(32) DISPLAY.
           03  R-id PIC S9(9) COMP-5.
           03  email PIC X(32) DISPLAY.
           03  PhoneNumber OCCURS 0 TO 10 DEPENDING ON PhoneNumber--C.
             05  R-number PIC X(32) DISPLAY.
             05  R-type PIC 9(4) COMP-5.
               88  MOBILE VALUE 0.
               88  HOME VALUE 1.
               88  WORK VALUE 2.