//*--------------------------------------------------------------------
//*- RUNS INTEGRATION TEST CASES
//*--------------------------------------------------------------------
//P390RUNI   JOB  (ACCT#),'FADY',
//           MSGCLASS=X,NOTIFY=&SYSUID,PRTY=14,REGION=0M
//*--------------------------------------------------------------------
//RUNTEST  PROC
//RUN  EXEC PGM=&PGMNAME,REGION=1024K
//STEPLIB  DD DSN=P390.DEV.LOAD,DISP=SHR
//SYSPRINT DD SYSOUT=*
//            PEND
//*--------------------------------------------------------------------
//            EXEC RUNTEST,PGMNAME=PBCTARRA
//*--------------------------------------------------------------------
//            EXEC RUNTEST,PGMNAME=PBCTATYP
//*--------------------------------------------------------------------
//            EXEC RUNTEST,PGMNAME=PBCTCUST
//*--------------------------------------------------------------------
//            EXEC RUNTEST,PGMNAME=PBCTENUM
//*--------------------------------------------------------------------
//            EXEC RUNTEST,PGMNAME=PBCTSIMP
//*--------------------------------------------------------------------
//            EXEC RUNTEST,PGMNAME=PBCTSREQ
//*--------------------------------------------------------------------
//            EXEC RUNTEST,PGMNAME=PBCTSRES
//*--------------------------------------------------------------------
//            EXEC RUNTEST,PGMNAME=PBCTTUTO
//*--------------------------------------------------------------------


