      * ----------------------------------------------------------------
      * Generated copybook for SearchResponse
      * ----------------------------------------------------------------
       01  SearchResponse.
           03  OCCURS-COUNTERS--C.
             05  Result--C PIC 9(9) COMP-5.
           03  Result OCCURS 0 TO 10 DEPENDING ON Result--C.
             05  url PIC X(32) DISPLAY.
             05  R-title PIC X(32) DISPLAY.
             05  snippets OCCURS 5 PIC X(32) DISPLAY.
